app/controllers/invitations_controller.rb

SELECT "invitations".* FROM "invitations"
---
   def index
		@invitations = Invitation.all

INSERT INTO "invitations" ("email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "ddsa"], ["message", "ds"], ["created_at", "2018-04-02 21:00:44.049613"], ["updated_at", "2018-04-02 21:00:44.049613"]]
---
	def create
		all_emails = params[:invitation][:all_emails]
		message = params[:invitation][:message]
		valid = true
		@invalids = []
		all_emails.split(/\s*,\s*/).each do |email|
			valid = false unless(email =~ /\A([\w+\-].?)+@[a-z\d\-]+(\.[a-z]+)*\.[a-z]+\z/i)
		end
		if valid
			all_emails.split(/\s*,\s*/).each do |email|
				raw_parameters = {:email => email, :message => message}
 puts raw_parameters
				parameters = ActionController::Parameters.new(raw_parameters)
				@invitation = Invitation.new(parameters.permit(:email, :message))
				@invitation.save